app/controllers/strains_controller.rb

  def index
    @strains = Strain.all
---
SELECT "strains".* FROM "strains"

  def create
    @strain = Strain.new(strain_params)

    respond_to do |format|
      if @strain.save
---
INSERT INTO "strains" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Malbec"], ["created_at", "2021-06-05 19:42:21.675947"], ["updated_at", "2021-06-05 19:42:21.675947"]]

    def set_strain
      @strain = Strain.find(params[:id])
---
SELECT "strains".* FROM "strains" WHERE "strains"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]