app/controllers/wines_controller.rb

SELECT "wines".* FROM "wines"
---
  def index
    @wines = Wine.all

SELECT "strains".* FROM "strains"
---
  def new
    @wine = Wine.new
    @strains = Strain.all

SELECT "strains".* FROM "strains"
---
  def edit
    @strains = Strain.all

INSERT INTO "wines" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "120"], ["created_at", "2021-06-05 19:43:21.746526"], ["updated_at", "2021-06-05 19:43:21.746526"]]
---
  def create
    @wine = Wine.new(wine_params)
    @strains = Strain.all

    respond_to do |format|
      if @wine.save

DELETE FROM "wines" WHERE "wines"."id" = $1  [["id", 2]]
---
  def destroy
    @wine.destroy

SELECT "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_wine
      @wine = Wine.find(params[:id])