app/models/wine.rb

SELECT "assemblies"."id" FROM "assemblies" WHERE "assemblies"."wine_id" = $1  [["wine_id", 1]]
SELECT "assemblies".* FROM "assemblies" WHERE "assemblies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "strains".* FROM "strains" WHERE "strains"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def order_strains
    strains = []
    self.assembly_ids.each do |assembly_id|
      strains.append(Strain.find(Assembly.find(assembly_id).strain_id).to_s+' ['+Assembly.find(assembly_id).percentage.to_s+'%]')